# Coverts halfwidth katakana to fullwidth hiragana.
# Usage: python hwkk2fwhg.py <input file> <output file>

import sys

pairs = [('ｦ','を'),
	('ｧ','ぁ'),
	('ｨ','ぃ'),
	('ｩ','ぅ'),
	('ｪ','ぇ'),
	('ｫ','ぉ'),
	('ｬ','ゃ'),
	('ｭ','ゅ'),
	('ｮ','ょ'),
	('ｯ','っ'),
	('ｱ','あ'),
	('ｲ','い'),
	('ｳ','う'),
	('ｴ','え'),
	('ｵ','お'),
	('ｶ','か'),
	('ｷ','き'),
	('ｸ','く'),
	('ｹ','け'),
	('ｺ','こ'),
	('ｻ','さ'),
	('ｼ','し'),
	('ｽ','す'),
	('ｾ','せ'),
	('ｿ','そ'),
	('ﾀ','た'),
	('ﾁ','ち'),
	('ﾂ','つ'),
	('ﾃ','て'),
	('ﾄ','と'),
	('ﾅ','な'),
	('ﾆ','に'),
	('ﾇ','ぬ'),
	('ﾈ','ね'),
	('ﾉ','の'),
	('ﾊ','は'),
	('ﾋ','ひ'),
	('ﾌ','ふ'),
	('ﾍ','へ'),
	('ﾎ','ほ'),
	('ﾏ','ま'),
	('ﾐ','み'),
	('ﾑ','む'),
	('ﾒ','め'),
	('ﾓ','も'),
	('ﾔ','や'),
	('ﾕ','ゆ'),
	('ﾖ','よ'),
	('ﾗ','ら'),
	('ﾘ','り'),
	('ﾙ','る'),
	('ﾚ','れ'),
	('ﾛ','ろ'),
	('ﾜ','わ'),
	('ﾝ','ん')]

f = open(sys.argv[2], "r", encoding="utf-8") # , encoding="shift_jis")
t = f.read()
f.close()

for i, j in pairs:
	t = t.replace(i, j)

g = open(sys.argv[3], "w", encoding="utf-8")
g.write(t)
g.close()

print("できたぞ")
